OpenNuvoton/MS51BSP_KEIL/MS51DA9AE_MS51BA9AE/Library/Device/Include/Function_Define_MS51_8K.h
//-----BOTH  edge ----                             
#define    IC0_P12_CAP0_BOTHEDGE_CAPTURE            CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON0|=0x10;CAPCON2|=0x10
#define    IC1_P11_CAP0_BOTHEDGE_CAPTURE            CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x01;CAPCON0|=0x10;CAPCON2|=0x10
#define    IC2_P10_CAP0_BOTHEDGE_CAPTURE            CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x02;CAPCON0|=0x10;CAPCON2|=0x10
#define    IC3_P00_CAP0_BOTHEDGE_CAPTURE            CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x03;CAPCON0|=0x10;CAPCON2|=0x10
#define    IC3_P04_CAP0_BOTHEDGE_CAPTURE            CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x04;CAPCON0|=0x10;CAPCON2|=0x10
#define    IC4_P01_CAP0_BOTHEDGE_CAPTURE            CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x05;CAPCON0|=0x10;CAPCON2|=0x10
#define    IC5_P03_CAP0_BOTHEDGE_CAPTURE            CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x06;CAPCON0|=0x10;CAPCON2|=0x10
#define    IC6_P05_CAP0_BOTHEDGE_CAPTURE            CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x07;CAPCON0|=0x10;CAPCON2|=0x10
#define    IC7_P15_CAP0_BOTHEDGE_CAPTURE            CAPCON1&=0xFC;CAPCON1|=0x02;CAPCON3&=0xF0;CAPCON3|=0x08;CAPCON0|=0x10;CAPCON2|=0x10
                                                   
#define    IC0_P12_CAP1_BOTHEDGE_CAPTURE            CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON0|=0x20;CAPCON2|=0x20
#define    IC1_P11_CAP1_BOTHEDGE_CAPTURE            CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x10;CAPCON0|=0x20;CAPCON2|=0x20
#define    IC2_P10_CAP1_BOTHEDGE_CAPTURE            CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x20;CAPCON0|=0x20;CAPCON2|=0x20
#define    IC3_P00_CAP1_BOTHEDGE_CAPTURE            CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x30;CAPCON0|=0x20;CAPCON2|=0x20
#define    IC3_P04_CAP1_BOTHEDGE_CAPTURE            CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x40;CAPCON0|=0x20;CAPCON2|=0x20
#define    IC4_P01_CAP1_BOTHEDGE_CAPTURE            CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x50;CAPCON0|=0x20;CAPCON2|=0x20
#define    IC5_P03_CAP1_BOTHEDGE_CAPTURE            CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x60;CAPCON0|=0x20;CAPCON2|=0x20
#define    IC6_P05_CAP1_BOTHEDGE_CAPTURE            CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x70;CAPCON0|=0x20;CAPCON2|=0x20
#define    IC7_P15_CAP1_BOTHEDGE_CAPTURE            CAPCON1&=0xF3;CAPCON1|=0x08;CAPCON3&=0x0F;CAPCON3|=0x80;CAPCON0|=0x20;CAPCON2|=0x20

#define    IC0_P12_CAP3_BOTHEDGE_CAPTURE            CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON0|=0x40;CAPCON2|=0x40
#define    IC1_P11_CAP3_BOTHEDGE_CAPTURE            CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x01;CAPCON0|=0x40;CAPCON2|=0x40
#define    IC2_P10_CAP3_BOTHEDGE_CAPTURE            CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x02;CAPCON0|=0x40;CAPCON2|=0x40
#define    IC3_P00_CAP3_BOTHEDGE_CAPTURE            CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x03;CAPCON0|=0x40;CAPCON2|=0x40
#define    IC3_P04_CAP3_BOTHEDGE_CAPTURE            CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x04;CAPCON0|=0x40;CAPCON2|=0x40
#define    IC4_P01_CAP3_BOTHEDGE_CAPTURE            CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x05;CAPCON0|=0x40;CAPCON2|=0x40
#define    IC5_P03_CAP3_BOTHEDGE_CAPTURE            CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x06;CAPCON0|=0x40;CAPCON2|=0x40
#define    IC6_P05_CAP3_BOTHEDGE_CAPTURE            CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x07;CAPCON0|=0x40;CAPCON2|=0x40
#define    IC7_P15_CAP3_BOTHEDGE_CAPTURE            CAPCON1&=0x0F;CAPCON1|=0x20;CAPCON4&=0xF0;CAPCON4|=0x08;CAPCON0|=0x40;CAPCON2|=0x40

/*****************************************************************************************
* For PWM setting 
*****************************************************************************************/
/*--------- PMW clock source select define --------------------- */
#define    PWM0_CLOCK_FSYS                         CKCON&=0xBF
#define    PWM0_CLOCK_TIMER1                       CKCON|=0x40
/*--------- PWM clock devide define ----------------------------*/
#define    PWM0_CLOCK_DIV_1                        PWMCON1&=0xF8
#define    PWM0_CLOCK_DIV_2                        PWMCON1&=0xF8;PWMCON1|=0x01
#define    PWM0_CLOCK_DIV_4                        PWMCON1&=0xF8;PWMCON1|=0x02
#define    PWM0_CLOCK_DIV_8                        PWMCON1&=0xF8;PWMCON1|=0x03
#define    PWM0_CLOCK_DIV_16                       PWMCON1&=0xF8;PWMCON1|=0x04
#define    PWM0_CLOCK_DIV_32                       PWMCON1&=0xF8;PWMCON1|=0x05
#define    PWM0_CLOCK_DIV_64                       PWMCON1&=0xF8;PWMCON1|=0x06
#define    PWM0_CLOCK_DIV_128                      PWMCON1|=0x07
/*--------- PWM I/O select define ------------------------------  */
#define    ENABLE_ALL_PWM0_OUTPUT                  clr_SFRS_SFRPAGE;PIOCON0=0xFF;PIOCON1=0xFF
#define    ENABLE_PWM0_CH5_P03_OUTPUT              clr_SFRS_SFRPAGE;PIOCON0|=0x20                                                //P0.3 as PWM5
#define    ENABLE_PWM0_CH4_P01_OUTPUT              clr_SFRS_SFRPAGE;PIOCON0|=0x10                                                //P0.1 as PWM4 output enable
#define    ENABLE_PWM0_CH3_P04_OUTPUT              set_SFRS_SFRPAGE;PIOCON1|=0x08;clr_SFRS_SFRPAGE              //P0.4 as PWM3 output enable
#define    ENABLE_PWM0_CH3_P00_OUTPUT              clr_SFRS_SFRPAGE;PIOCON0|=0x08                                                //P0.0 as PWM3 
#define    ENABLE_PWM0_CH2_P05_OUTPUT              set_SFRS_SFRPAGE;PIOCON1|=0x04;clr_SFRS_SFRPAGE              //P1.0 as PWM2 output enable
 #define   ENABLE_PWM0_CH2_P10_OUTPUT              clr_SFRS_SFRPAGE;PIOCON0|=0x04                                                //P1.0 as PWM2
#define    ENABLE_PWM0_CH0_P02_OUTPUT              clr_SFRS_SFRPAGE;PIOCON0|=0x01 
                                                       //P1.2 as PWM0 output enable
#define    DISABLE_ALL_PWM0_OUTPUT                 PIOCON0=0x00;PIOCON1=0x00
#define    DISABLE_PWM0_CH5_P03_OUTPUT             PIOCON0&=0xDF                                                //P0.3 as PWM5
#define    DISABLE_PWM0_CH4_P01_OUTPUT             PIOCON0&=0xEF                                                //P0.1 as PWM4 output disable
#define    DISABLE_PWM0_CH3_P04_OUTPUT             set_SFRS_SFRPAGE;PIOCON1&=0xF7;clr_SFRS_SFRPAGE              //P0.4 as PWM3 output disable
#define    DISABLE_PWM0_CH3_P00_OUTPUT             PIOCON0&=0xF7                                                //P0.0 as PWM3 
#define    DISABLE_PWM0_CH2_P05_OUTPUT             set_SFRS_SFRPAGE;PIOCON1&=0xFB;clr_SFRS_SFRPAGE              //P1.0 as PWM2 output disable
#define    DISABLE_PWM0_CH2_P10_OUTPUT             PIOCON0&=0xFB                                                //P1.0 as PWM2
#define    DISABLE_PWM0_CH0_P02_OUTPUT             PIOCON0&=0xFE                                                //P1.2 as PWM0 output disable
/*--------- PWM I/O Polarity Control ---------------------------*/
#define    PWM0_OUTPUT_ALL_INVERSE                 PNP=0xFF
#define    PWM0_OUTPUT_ALL_NORMAL                  PNP=0x00
                                                   
