OpenNuvoton/MS51BSP_KEIL/MS51DA9AE_MS51BA9AE/Library/Device/Include/Function_Define_MS51_8K.h
/***************************************************************************************/
/* For SPI INIT setting *                                                               /
/***************************************************************************************/
#define    SPICLK_FSYS_DIV2                       clr_SFRS_SFRPAGE;SPCR&=0xFC
#define    SPICLK_FSYS_DIV4                       clr_SFRS_SFRPAGE;SPCR&=0xFC;SPCR|=0x01
#define    SPICLK_FSYS_DIV8                       clr_SFRS_SFRPAGE;SPCR&=0xFC;SPCR|=0x02
#define    SPICLK_FSYS_DIV16                      clr_SFRS_SFRPAGE;SPCR&=0xFC;SPCR|=0x03
                                                 
#define    SS                                     P05
/******************************************************************************************/
/* For UART0 and UART1 and printf funcion                                                  /
/******************************************************************************************/
#define ENABLE_UART0_PRINTF                       set_SCON_TI;PRINTFG=1            //For printf function must setting TI = 1
#define DISABLE_UART0_PRINTF                      clr_SCON_TI;PRINTFG=0
#define ENABLE_UART1_PRINTF                       set_SCON_1_TI_1;PRINTFG=1
#define DISABLE_UART1_PRINTF                      clr_SCON_1_TI_1;PRINTFG=0
/*****************************************************************************************/
/* INT0 setting                                                                          */
/*****************************************************************************************/
#define INT0_FALLING_EDGE_TRIG                    set_TCON_IT0
#define INT0_LOW_LEVEL_TRIG                       clr_TCON_IT0
                                               
/*****************************************************************************************/
/* INT1 setting                                                                          */
/*****************************************************************************************/
#define INT1_FALLING_EDGE_TRIG                    set_TCON_IT1
#define INT1_LOW_LEVEL_TRIG                       clr_TCON_IT1
